//************************************************************************************
// 
// ゲームデータ管理[Gamedata.h]
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __GAMEDATA_H__
#define __GAMEDATA_H__

//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- プロトタイプ宣言 --------------------
HRESULT	InitData();			// 初期化
void	UninitData();		// 終了
void	SaveRankData();		// ランキングセーブ
int*	LoadRankData();		// ランキングロード
int*	LoadBoardDate();	// ボードデータロード
#endif