//************************************************************************************
// 
// 遊び方[HowToPlay.h]
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __HOWTOPLAY_H__
#define __HOWTOPLAY_H__
//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- プロトタイプ宣言 --------------------
HRESULT	InitHowToPlay();	// 初期化
void	UninitHowToPlay();	// 終了
void	UpdateHowToPlay();	// 更新
void	DrawHowToPlay();	// 描画

#endif

