//************************************************************************************
// 
// リザルト[resulut.h]
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __RESULT__H__
#define __RESULT__H__

//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- プロトタイプ宣言 --------------------
HRESULT	InitResult();	// 初期化
void	UninitResult();	// 終了
void	UpdateResult();	// 更新
void	DrawResult();	// 描画

#endif

