//************************************************************************************
// 
// サウンド定義[SoundData.h]
// 編集者：伊地田真衣
// 
//************************************************************************************

//-------------------- 定数定義 --------------------
enum eBGM {
	BGM_000 = 0,	// BGM0
	BGM_001,		// BGM1
	BGM_002,		// BGM2

	MAX_BGM
};

enum eSE {
	SE_DECIDE_1,	// 決定音(スタート画面)
	SE_DECIDE_2,	// 決定音(そのほか)
	SE_CANCEL,		// キャンセル音
	SE_SELECT,		// 選択音
	SE_TILESELECT_1,// 牌選択音１
	SE_TILESELECT_2,// 牌選択音２

	MAX_SE
};
