//************************************************************************************
// 
// サウンドデータ定義[SoundData.h]
// 編集者：伊地田真衣
// 
//************************************************************************************

//-------------------- グローバル変数 --------------------
LPCWSTR g_pszFileBGM[MAX_BGM] = {
	L"bgm000.mp3",			// BGM0
	L"bgm001.mp3",			// BGM1
	L"bgm002.mp3",			// BGM2
};

LPCWSTR g_pszFileSE[MAX_SE] = {
	L"decide000.mp3",		// 決定音
	L"decide001.mp3",		// 決定音
	L"cancel000.wav",		// キャンセル音
	L"select000.wav",		// 選択音
	L"select001.mp3",		// 牌選択音
	L"select002.mp3",		// 牌選択音(消せるとき)
};
