//************************************************************************************
// 
// タイマー[timer.h]
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __TIMER_H__
#define __TIMER_H__
//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- インクルード部 --------------------
HRESULT InitTimer();			// 初期化
void UninitTimer();				// 終了処理
void DrawTimer();				// 描画処理
void UpdateTimer();				// 更新処理

int GetTimer();					// 取得
void resetTimer();				// リセット

#endif