//************************************************************************************
// 
// タイトル[Title.h]
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __TITLE_H__
#define __TITLE_H__
//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- プロトタイプ宣言 --------------------
HRESULT	InitTitle();	// 初期化
void	UninitTitle();	// 終了
void	UpdateTitle();	// 更新
void	DrawTitle();	// 描画

#endif // !__TITLE_H__

